syms a b;
c = [a b]';

A = [306.35, 311.2, 324.9, 343.4, 361.61, 390.76, 421.36, 458.75, 494.9, 522.78, 547.22, 588.7, 647.18, 712.34, 778.32, 835.31, 888.1, 923.16, 939.48];
n = length(A);

P = cumsum(A);
C = [];
for i = 2:n
    C(i) = (P(i) + P(i - 1)) / 2; %背景值采用梯形公式
end
C(1) = [];

B = [-C; ones(1, n - 1)];
Y = A; Y(1) = []; Y = Y';

c = inv(B * B') * B * Y;
c = c';
a = c(1); b = c(2);

F = []; F(1) = A(1);
for i = 2:(n + 3)
    F(i) = (A(1) - b / a) / exp(a * (i - 1)) + b / a;
end

G = []; G(1) = A(1);
for i = 2:(n + 3) 
    G(i) = F(i) - F(i-1);
end

t1 = 1980:1998;
t2 = 1980:2001;

plot(t1, A, 'ro'); hold on;
plot(t2, G, 'g-');
xlabel('年份'); ylabel('人均发电量');
legend('原始数据','预测值');
title('人均发电量GM(1,1)模型预测');
grid on;